In [11]:
import pandas as pd

In [12]:
rawD = pd.read_excel("rawData.xlsx",index_col=0, sheet_name=[0,1,2,3,4,5])

In [13]:
equ = rawD[0]
equ.columns = ['RAY','VIX','IWV','EEM','QQQ','VXUS']
equ.head()

                 RAY    VIX     IWV      EEM     QQQ   VXUS
Date
2022-02-01  2631.460  23.00  262.21  1112.23  363.72  62.11
2022-01-31  2621.974  24.83  261.18  1101.20  363.05  61.77
2022-01-28  2566.786  27.66  255.70  1079.16  351.80  60.61
2022-01-27  2505.657  30.49  249.65  1079.98  341.10  60.32
2022-01-26  2523.635  31.96  251.27  1037.80  344.57  60.75

In [25]:
equ.shape

(8155, 6)

In [17]:
fix = rawD[1].loc[::-1]
fix.head()

            T10Y3M
Date
2022-01-31    1.57
2022-01-28    1.59
2022-01-27    1.61
2022-01-26    1.66
2022-01-25    1.59

In [26]:
fix.shape

(8370, 1)

In [20]:
com = rawD[2].iloc[:,:4]
com.columns = ['CL1','HG1','GC1','XAG']
com.head()

              CL1     HG1     GC1      XAG
Date
2022-02-01  88.21  443.10  1798.5  22.6440
2022-01-31  88.15  432.45  1795.0  22.4660
2022-01-28  86.82  431.00  1784.9  22.4727
2022-01-27  86.61  442.35  1793.1  22.7680
2022-01-26  87.35  451.50  1829.7  23.5305

In [27]:
com.shape

(8338, 4)

In [22]:
reales = rawD[4]
reales.columns = ['VNQ']
reales.head()

               VNQ
Date
2022-02-01  105.86
2022-01-31  106.24
2022-01-28  104.95
2022-01-27  101.66
2022-01-26  103.37

In [28]:
reales.shape

(4367, 1)

In [23]:
macro = rawD[5]
macro.columns = ['EURtoUSD']
macro.head()

            EURtoUSD
Date
2022-02-01    1.1266
2022-01-31    1.1235
2022-01-28    1.1151
2022-01-27    1.1145
2022-01-26    1.1240

In [29]:
macro.shape

(8300, 1)

In [30]:
df = pd.concat([equ, fix, com, reales, macro], axis=1, join='outer')
df.head()

,RAY,VIX,IWV,EEM,QQQ,VXUS,T10Y3M,CL1,HG1,GC1,XAG,VNQ,EURtoUSD
Date,,,,,,,,,,,,,
1990-01-02,200.241,17.24,NaN,NaN,NaN,NaN,0.11,NaN,NaN,NaN,NaN,NaN,1.2146
1990-01-03,200.116,18.19,NaN,NaN,NaN,NaN,0.10,NaN,NaN,NaN,NaN,NaN,1.2096
1990-01-04,198.646,19.22,NaN,NaN,NaN,NaN,0.14,NaN,NaN,NaN,NaN,NaN,1.2287
1990-01-05,196.850,20.11,NaN,NaN,NaN,NaN,0.20,NaN,NaN,NaN,NaN,NaN,1.2358
1990-01-08,197.525,20.26,NaN,NaN,NaN,NaN,0.23,NaN,NaN,NaN,NaN,NaN,1.2452

In [31]:
df.shape

(8371, 13)

In [32]:
df.to_excel('Data.xlsx')